Revit 2016 API
LoadCaseSet Members
The LoadCaseSet type exposes the following members.
Constructors
Name | Description
LoadCaseSet
Initializes a new instance of the LoadCaseSet class
Methods
Name | Description
Clear
Contains
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Erase
ForwardIterator
GetEnumerator
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Insert
ReverseIterator
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsEmpty
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
See Also
LoadCaseSet Class
Autodesk.Revit.DB.Structure Namespace